bigger_pipe/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( -0.735  -0.62 -0.01)
    (  0.31   -0.62 -0.01)
    (  0.31   0.426 -0.01)
    ( -0.735  0.426 -0.01)
    ( -0.735 -0.62 2.04)
    (  0.31  -0.62 2.04)
    (  0.31   0.426 2.04)
    ( -0.735  0.426 2.04)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)



        );
    }
   ceiling
    {
        type wall;
        faces
        (
            
	    (4 5 6 7)


        );
    }
  
);

// ************************************************************************* //
