bigger_pipe/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    allBoundary
    {
        type            fixedValue;
        value           uniform 293;
    }
	
    box
    {
        type            fixedValue;
        value           uniform 293;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }
      outlet
    {
        type            fixedValue;
        value           uniform 293;
    }
      thermal
    {
    type        fixedGradient;
    gradient    uniform 400;
    }
ceiling
    {
        type            fixedValue;
        value           uniform 293;
    }
}

// ************************************************************************* //
